clc;
clear;

% Ορισμός σημείου στο χώρο
X = input('Δώσε Χ: ');
Y = input('Δώσε Υ: ');
Z = input('Δώσε Ζ: ');
A = [X; Y; Z; 1];
f = 1000; % Εστιακό μήκος
cx = 320; cy = 240; % Πρωτεύον σημείο
K = [f 0 cx; 0 f cy; 0 0 1]; % Εσωτερικές παραμέτρους

C = [2; 3; 5]; % Θέση κάμερας
w = pi/12; v = pi/18; u = pi/20;

% Πίνακας περιστροφής
Rw = [1 0 0; 0 cos(w) -sin(w); 0 sin(w) cos(w)];
Rv = [cos(v) 0 sin(v); 0 1 0; -sin(v) 0 cos(v)];
Ru = [cos(u) -sin(u) 0; sin(u) cos(u) 0; 0 0 1];
R = Ru * Rv * Rw;

% 1ος Τρόπος: Συγγραμικότητα
Xc = R * ([X; Y; Z] - C); % Συντεταγμένες στο σύστημα της κάμερας
x1 = f * Xc(1) / Xc(3) + cx;
y1 = f * Xc(2) / Xc(3) + cy; 

% 2ος Τρόπος: x = P * X
P = K * [R, -R*C]; % Πίνακας προβολής
pt_hom = P * A;
x2 = pt_hom(1) / pt_hom(3);
y2 = pt_hom(2) / pt_hom(3);

fprintf('\nΑποτελέσματα\n');
fprintf('Με 1η μέθοδο: x = %.2f, y = %.2f\n', x1, y1);
fprintf('Με 2η μέθοδο: x = %.2f, y = %.2f\n', x2, y2);
fprintf('Διαφορά: %.10f\n', norm([x1 - x2; y1 - y2]));